import './App.css';

function App() {
  return (
    <div className="App">
      <h1>네번째 프로젝트</h1>
      <h2>제이쿼리 리액트 전환 프로젝트 : 두번째 프로젝트(feat.신발가게) 강화</h2>
      <br />
      <h4>목표 작업 기간</h4>
      <p>2024/02/07 ~ 2024/02/08</p>
      <br />
      <h4>목적</h4>
      <li>리액트 기초 익히기</li>
      <li>두번째 프로젝트 퀄리티 향상(디바이스 디스플레이 안정화, 데이터 보강, 레이아웃 보강)</li>
      <li>챗GPT 활용 능력 강화</li>
      <li>깃허브 사용 강화</li>
      <br />
      <h4>작업 사이클</h4>
      <li>작업 목록 작성</li>
      <li>분할 작성된 코드를 챗GPT를 활용하여 리액트 코드로 전환</li>
      <li>전환 코드 리액트 컴포넌트 이식</li>
      <li>오류 발생</li>
      <li>오류 해결</li>
      <li>코드 개선</li>
      <li>깃허브 커밋 & 푸시</li>
      <li>추가 작업: 상품 보강</li>
    </div>
  );
}

export default App;
